OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f67j94.h
extern __at(0x0E7A) __sfr ADCTMUEN0L;

typedef struct
  {
  unsigned CTMUEN0              : 1;
  unsigned CTMUEN1              : 1;
  unsigned CTMUEN2              : 1;
  unsigned CTMUEN3              : 1;
  unsigned CTMUEN4              : 1;
  unsigned CTMUEN5              : 1;
  unsigned CTMUEN6              : 1;
  unsigned CTMUEN7              : 1;
  } __ADCTMUEN0Lbits_t;

extern __at(0x0E7A) volatile __ADCTMUEN0Lbits_t ADCTMUEN0Lbits;

#define _CTMUEN0                0x01
#define _CTMUEN1                0x02
#define _CTMUEN2                0x04
#define _CTMUEN3                0x08
#define _CTMUEN4                0x10
#define _CTMUEN5                0x20
#define _CTMUEN6                0x40
#define _CTMUEN7                0x80

//==============================================================================


//==============================================================================
//        ADCTMUEN0H Bits

extern __at(0x0E7B) __sfr ADCTMUEN0H;

typedef struct
  {
  unsigned CTMUEN8              : 1;
  unsigned CTMUEN9              : 1;
  unsigned CTMUEN10             : 1;
  unsigned CTMUEN11             : 1;
  unsigned CTMUEN12             : 1;
  unsigned CTMUEN13             : 1;
  unsigned CTMUEN14             : 1;
  unsigned CTMUEN15             : 1;
  } __ADCTMUEN0Hbits_t;

extern __at(0x0E7B) volatile __ADCTMUEN0Hbits_t ADCTMUEN0Hbits;

#define _CTMUEN8                0x01
#define _CTMUEN9                0x02
#define _CTMUEN10               0x04
#define _CTMUEN11               0x08
#define _CTMUEN12               0x10
#define _CTMUEN13               0x20
#define _CTMUEN14               0x40
#define _CTMUEN15               0x80

//==============================================================================


//==============================================================================
//        ADCTMUEN1L Bits

extern __at(0x0E7C) __sfr ADCTMUEN1L;

typedef struct
  {
  unsigned CTUMEN16             : 1;
  unsigned CTUMEN17             : 1;
  unsigned CTUMEN18             : 1;
  unsigned CTUMEN19             : 1;
  unsigned CTMUEN20             : 1;
  unsigned CTMUEN21             : 1;
  unsigned CTMUEN22             : 1;
  unsigned CTMUEN23             : 1;
  } __ADCTMUEN1Lbits_t;

extern __at(0x0E7C) volatile __ADCTMUEN1Lbits_t ADCTMUEN1Lbits;

#define _CTUMEN16               0x01
#define _CTUMEN17               0x02
#define _CTUMEN18               0x04
#define _CTUMEN19               0x08
#define _CTMUEN20               0x10
#define _CTMUEN21               0x20
#define _CTMUEN22               0x40
#define _CTMUEN23               0x80

//==============================================================================


//==============================================================================
//        ADCTMUEN1H Bits

extern __at(0x0E7D) __sfr ADCTMUEN1H;

typedef struct
  {
  unsigned CTUMEN24             : 1;
  unsigned CTUMEN25             : 1;
  unsigned CTUMEN26             : 1;
  unsigned CTUMEN27             : 1;
  unsigned CTUMEN28             : 1;
  unsigned CTUMEN29             : 1;
  unsigned CTMUEN30             : 1;
  unsigned                      : 1;
  } __ADCTMUEN1Hbits_t;

extern __at(0x0E7D) volatile __ADCTMUEN1Hbits_t ADCTMUEN1Hbits;

#define _CTUMEN24               0x01
#define _CTUMEN25               0x02
#define _CTUMEN26               0x04
#define _CTUMEN27               0x08
#define _CTUMEN28               0x10
#define _CTUMEN29               0x20
#define _CTMUEN30               0x40

//==============================================================================


//==============================================================================
//        ADCHIT0L Bits

extern __at(0x0E7E) __sfr ADCHIT0L;

typedef struct
  {
  unsigned CHH0                 : 1;
  unsigned CHH1                 : 1;
  unsigned CHH2                 : 1;
  unsigned CHH3                 : 1;
  unsigned CHH4                 : 1;
  unsigned CHH5                 : 1;
  unsigned CHH6                 : 1;
  unsigned CHH7                 : 1;
  } __ADCHIT0Lbits_t;

extern __at(0x0E7E) volatile __ADCHIT0Lbits_t ADCHIT0Lbits;

#define _CHH0                   0x01
#define _CHH1                   0x02
#define _CHH2                   0x04
#define _CHH3                   0x08
#define _CHH4                   0x10
#define _CHH5                   0x20
#define _CHH6                   0x40
#define _CHH7                   0x80

//==============================================================================


//==============================================================================
//        ADCHIT0H Bits

extern __at(0x0E7F) __sfr ADCHIT0H;

typedef struct
  {
  unsigned CHH8                 : 1;
  unsigned CHH9                 : 1;
  unsigned CHH10                : 1;
  unsigned CHH11                : 1;
  unsigned CHH12                : 1;
  unsigned CHH13                : 1;
  unsigned CHH14                : 1;
  unsigned CHH15                : 1;
  } __ADCHIT0Hbits_t;

extern __at(0x0E7F) volatile __ADCHIT0Hbits_t ADCHIT0Hbits;

#define _CHH8                   0x01
#define _CHH9                   0x02
#define _CHH10                  0x04
#define _CHH11                  0x08
#define _CHH12                  0x10
#define _CHH13                  0x20
#define _CHH14                  0x40
#define _CHH15                  0x80

//==============================================================================


//==============================================================================
//        ADCHIT1L Bits

extern __at(0x0E80) __sfr ADCHIT1L;

typedef struct
  {
  unsigned CHH16                : 1;
  unsigned CHH17                : 1;
  unsigned CHH18                : 1;
  unsigned CHH19                : 1;
  unsigned CHH20                : 1;
  unsigned CHH21                : 1;
  unsigned CHH22                : 1;
  unsigned CHH23                : 1;
  } __ADCHIT1Lbits_t;

extern __at(0x0E80) volatile __ADCHIT1Lbits_t ADCHIT1Lbits;

#define _CHH16                  0x01
#define _CHH17                  0x02
#define _CHH18                  0x04
#define _CHH19                  0x08
#define _CHH20                  0x10
#define _CHH21                  0x20
#define _CHH22                  0x40
#define _CHH23                  0x80

//==============================================================================


//==============================================================================
//        ADCHIT1H Bits

