OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f67j94.h
extern __at(0x0EA4) __sfr LCDDATA22;

typedef struct
  {
  unsigned S48C2                : 1;
  unsigned S49C2                : 1;
  unsigned S50C2                : 1;
  unsigned S51C2                : 1;
  unsigned S52C2                : 1;
  unsigned S53C2                : 1;
  unsigned S54C2                : 1;
  unsigned S55C2                : 1;
  } __LCDDATA22bits_t;

extern __at(0x0EA4) volatile __LCDDATA22bits_t LCDDATA22bits;

#define _S48C2                  0x01
#define _S49C2                  0x02
#define _S50C2                  0x04
#define _S51C2                  0x08
#define _S52C2                  0x10
#define _S53C2                  0x20
#define _S54C2                  0x40
#define _S55C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA23 Bits

extern __at(0x0EA5) __sfr LCDDATA23;

typedef struct
  {
  unsigned S56C2                : 1;
  unsigned S57C2                : 1;
  unsigned S58C2                : 1;
  unsigned S59C2                : 1;
  unsigned S60C2                : 1;
  unsigned S61C2                : 1;
  unsigned S62C2                : 1;
  unsigned S63C2                : 1;
  } __LCDDATA23bits_t;

extern __at(0x0EA5) volatile __LCDDATA23bits_t LCDDATA23bits;

#define _S56C2                  0x01
#define _S57C2                  0x02
#define _S58C2                  0x04
#define _S59C2                  0x08
#define _S60C2                  0x10
#define _S61C2                  0x20
#define _S62C2                  0x40
#define _S63C2                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA24 Bits

extern __at(0x0EA6) __sfr LCDDATA24;

typedef struct
  {
  unsigned S00C3                : 1;
  unsigned S01C3                : 1;
  unsigned S02C3                : 1;
  unsigned S03C3                : 1;
  unsigned S04C3                : 1;
  unsigned S05C3                : 1;
  unsigned S06C3                : 1;
  unsigned S07C3                : 1;
  } __LCDDATA24bits_t;

extern __at(0x0EA6) volatile __LCDDATA24bits_t LCDDATA24bits;

#define _S00C3                  0x01
#define _S01C3                  0x02
#define _S02C3                  0x04
#define _S03C3                  0x08
#define _S04C3                  0x10
#define _S05C3                  0x20
#define _S06C3                  0x40
#define _S07C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA25 Bits

extern __at(0x0EA7) __sfr LCDDATA25;

typedef struct
  {
  unsigned S08C3                : 1;
  unsigned S09C3                : 1;
  unsigned S10C3                : 1;
  unsigned S11C3                : 1;
  unsigned S12C3                : 1;
  unsigned S13C3                : 1;
  unsigned S14C3                : 1;
  unsigned S15C3                : 1;
  } __LCDDATA25bits_t;

extern __at(0x0EA7) volatile __LCDDATA25bits_t LCDDATA25bits;

#define _S08C3                  0x01
#define _S09C3                  0x02
#define _S10C3                  0x04
#define _S11C3                  0x08
#define _S12C3                  0x10
#define _S13C3                  0x20
#define _S14C3                  0x40
#define _S15C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA26 Bits

extern __at(0x0EA8) __sfr LCDDATA26;

typedef struct
  {
  unsigned S16C3                : 1;
  unsigned S17C3                : 1;
  unsigned S18C3                : 1;
  unsigned S19C3                : 1;
  unsigned S20C3                : 1;
  unsigned S21C3                : 1;
  unsigned S22C3                : 1;
  unsigned S23C3                : 1;
  } __LCDDATA26bits_t;

extern __at(0x0EA8) volatile __LCDDATA26bits_t LCDDATA26bits;

#define _S16C3                  0x01
#define _S17C3                  0x02
#define _S18C3                  0x04
#define _S19C3                  0x08
#define _S20C3                  0x10
#define _S21C3                  0x20
#define _S22C3                  0x40
#define _S23C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA27 Bits

extern __at(0x0EA9) __sfr LCDDATA27;

typedef struct
  {
  unsigned S24C3                : 1;
  unsigned S25C3                : 1;
  unsigned S26C3                : 1;
  unsigned S27C3                : 1;
  unsigned S28C3                : 1;
  unsigned S29C3                : 1;
  unsigned S30C3                : 1;
  unsigned S31C3                : 1;
  } __LCDDATA27bits_t;

extern __at(0x0EA9) volatile __LCDDATA27bits_t LCDDATA27bits;

#define _S24C3                  0x01
#define _S25C3                  0x02
#define _S26C3                  0x04
#define _S27C3                  0x08
#define _S28C3                  0x10
#define _S29C3                  0x20
#define _S30C3                  0x40
#define _S31C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA28 Bits

extern __at(0x0EAA) __sfr LCDDATA28;

typedef struct
  {
  unsigned S32C3                : 1;
  unsigned S33C3                : 1;
  unsigned S34C3                : 1;
  unsigned S35C3                : 1;
  unsigned S36C3                : 1;
  unsigned S37C3                : 1;
  unsigned S38C3                : 1;
  unsigned S39C3                : 1;
  } __LCDDATA28bits_t;

extern __at(0x0EAA) volatile __LCDDATA28bits_t LCDDATA28bits;

#define _S32C3                  0x01
#define _S33C3                  0x02
#define _S34C3                  0x04
#define _S35C3                  0x08
#define _S36C3                  0x10
#define _S37C3                  0x20
#define _S38C3                  0x40
#define _S39C3                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA29 Bits

extern __at(0x0EAB) __sfr LCDDATA29;

typedef struct
  {
  unsigned S40C3                : 1;
  unsigned S41C3                : 1;
  unsigned S42C3                : 1;
  unsigned S43C3                : 1;
  unsigned S44C3                : 1;
  unsigned S45C3                : 1;
  unsigned S46C3                : 1;
  unsigned S47C3                : 1;
  } __LCDDATA29bits_t;

extern __at(0x0EAB) volatile __LCDDATA29bits_t LCDDATA29bits;

