OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f67j94.h
#define _S48C6                  0x01
#define _S49C6                  0x02
#define _S50C6                  0x04
#define _S51C6                  0x08
#define _S52C6                  0x10
#define _S53C6                  0x20
#define _S54C6                  0x40
#define _S55C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA55 Bits

extern __at(0x0EC5) __sfr LCDDATA55;

typedef struct
  {
  unsigned S56C6                : 1;
  unsigned S57C6                : 1;
  unsigned S58C6                : 1;
  unsigned S59C6                : 1;
  unsigned S60C6                : 1;
  unsigned S61C6                : 1;
  unsigned S62C6                : 1;
  unsigned S63C6                : 1;
  } __LCDDATA55bits_t;

extern __at(0x0EC5) volatile __LCDDATA55bits_t LCDDATA55bits;

#define _S56C6                  0x01
#define _S57C6                  0x02
#define _S58C6                  0x04
#define _S59C6                  0x08
#define _S60C6                  0x10
#define _S61C6                  0x20
#define _S62C6                  0x40
#define _S63C6                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA56 Bits

extern __at(0x0EC6) __sfr LCDDATA56;

typedef struct
  {
  unsigned S00C7                : 1;
  unsigned S01C7                : 1;
  unsigned S02C7                : 1;
  unsigned S03C7                : 1;
  unsigned S04C7                : 1;
  unsigned S05C7                : 1;
  unsigned S06C7                : 1;
  unsigned S07C7                : 1;
  } __LCDDATA56bits_t;

extern __at(0x0EC6) volatile __LCDDATA56bits_t LCDDATA56bits;

#define _S00C7                  0x01
#define _S01C7                  0x02
#define _S02C7                  0x04
#define _S03C7                  0x08
#define _S04C7                  0x10
#define _S05C7                  0x20
#define _S06C7                  0x40
#define _S07C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA57 Bits

extern __at(0x0EC7) __sfr LCDDATA57;

typedef struct
  {
  unsigned S08C7                : 1;
  unsigned S09C7                : 1;
  unsigned S10C7                : 1;
  unsigned S11C7                : 1;
  unsigned S12C7                : 1;
  unsigned S13C7                : 1;
  unsigned S14C7                : 1;
  unsigned S15C7                : 1;
  } __LCDDATA57bits_t;

extern __at(0x0EC7) volatile __LCDDATA57bits_t LCDDATA57bits;

#define _S08C7                  0x01
#define _S09C7                  0x02
#define _S10C7                  0x04
#define _S11C7                  0x08
#define _S12C7                  0x10
#define _S13C7                  0x20
#define _S14C7                  0x40
#define _S15C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA58 Bits

extern __at(0x0EC8) __sfr LCDDATA58;

typedef struct
  {
  unsigned S16C7                : 1;
  unsigned S17C7                : 1;
  unsigned S18C7                : 1;
  unsigned S19C7                : 1;
  unsigned S20C7                : 1;
  unsigned S21C7                : 1;
  unsigned S22C7                : 1;
  unsigned S23C7                : 1;
  } __LCDDATA58bits_t;

extern __at(0x0EC8) volatile __LCDDATA58bits_t LCDDATA58bits;

#define _S16C7                  0x01
#define _S17C7                  0x02
#define _S18C7                  0x04
#define _S19C7                  0x08
#define _S20C7                  0x10
#define _S21C7                  0x20
#define _S22C7                  0x40
#define _S23C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA59 Bits

extern __at(0x0EC9) __sfr LCDDATA59;

typedef struct
  {
  unsigned S24C7                : 1;
  unsigned S25C7                : 1;
  unsigned S26C7                : 1;
  unsigned S27C7                : 1;
  unsigned S28C7                : 1;
  unsigned S29C7                : 1;
  unsigned S30C7                : 1;
  unsigned S31C7                : 1;
  } __LCDDATA59bits_t;

extern __at(0x0EC9) volatile __LCDDATA59bits_t LCDDATA59bits;

#define _S24C7                  0x01
#define _S25C7                  0x02
#define _S26C7                  0x04
#define _S27C7                  0x08
#define _S28C7                  0x10
#define _S29C7                  0x20
#define _S30C7                  0x40
#define _S31C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA60 Bits

extern __at(0x0ECA) __sfr LCDDATA60;

typedef struct
  {
  unsigned S32C7                : 1;
  unsigned S33C7                : 1;
  unsigned S34C7                : 1;
  unsigned S35C7                : 1;
  unsigned S36C7                : 1;
  unsigned S37C7                : 1;
  unsigned S38C7                : 1;
  unsigned S39C7                : 1;
  } __LCDDATA60bits_t;

extern __at(0x0ECA) volatile __LCDDATA60bits_t LCDDATA60bits;

#define _S32C7                  0x01
#define _S33C7                  0x02
#define _S34C7                  0x04
#define _S35C7                  0x08
#define _S36C7                  0x10
#define _S37C7                  0x20
#define _S38C7                  0x40
#define _S39C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA61 Bits

extern __at(0x0ECB) __sfr LCDDATA61;

typedef struct
  {
  unsigned S40C7                : 1;
  unsigned S41C7                : 1;
  unsigned S42C7                : 1;
  unsigned S43C7                : 1;
  unsigned S44C7                : 1;
  unsigned S45C7                : 1;
  unsigned S46C7                : 1;
  unsigned S47C7                : 1;
  } __LCDDATA61bits_t;

extern __at(0x0ECB) volatile __LCDDATA61bits_t LCDDATA61bits;

#define _S40C7                  0x01
#define _S41C7                  0x02
#define _S42C7                  0x04
#define _S43C7                  0x08
#define _S44C7                  0x10
#define _S45C7                  0x20
#define _S46C7                  0x40
#define _S47C7                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA62 Bits

extern __at(0x0ECC) __sfr LCDDATA62;

typedef struct
  {
  unsigned S48C7                : 1;
  unsigned S49C7                : 1;
  unsigned S50C7                : 1;
  unsigned S51C7                : 1;
  unsigned S52C7                : 1;
  unsigned S53C7                : 1;
  unsigned S54C7                : 1;
  unsigned S55C7                : 1;
  } __LCDDATA62bits_t;

extern __at(0x0ECC) volatile __LCDDATA62bits_t LCDDATA62bits;

