OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f67j94.h
extern __at(0x0F68) volatile __SSP1MSKbits_t SSP1MSKbits;

#define _MSK0                   0x01
#define _MSK1                   0x02
#define _MSK2                   0x04
#define _MSK3                   0x08
#define _MSK4                   0x10
#define _MSK5                   0x20
#define _MSK6                   0x40
#define _MSK7                   0x80

//==============================================================================


//==============================================================================
//        SSP1CON3 Bits

extern __at(0x0F69) __sfr SSP1CON3;

typedef struct
  {
  unsigned DHEN                 : 1;
  unsigned AHEN                 : 1;
  unsigned SBCDE                : 1;
  unsigned SDAHT                : 1;
  unsigned BOEN                 : 1;
  unsigned SCIE                 : 1;
  unsigned PCIE                 : 1;
  unsigned ACKTIM               : 1;
  } __SSP1CON3bits_t;

extern __at(0x0F69) volatile __SSP1CON3bits_t SSP1CON3bits;

#define _DHEN                   0x01
#define _AHEN                   0x02
#define _SBCDE                  0x04
#define _SDAHT                  0x08
#define _BOEN                   0x10
#define _SCIE                   0x20
#define _PCIE                   0x40
#define _ACKTIM                 0x80

//==============================================================================


//==============================================================================
//        TXBUF Bits

extern __at(0x0F6A) __sfr TXBUF;

typedef struct
  {
  unsigned TXBUF0               : 1;
  unsigned TXBUF1               : 1;
  unsigned TXBUF2               : 1;
  unsigned TXBUF3               : 1;
  unsigned TXBUF4               : 1;
  unsigned TXBUF5               : 1;
  unsigned TXBUF6               : 1;
  unsigned TXBUF7               : 1;
  } __TXBUFbits_t;

extern __at(0x0F6A) volatile __TXBUFbits_t TXBUFbits;

#define _TXBUF0                 0x01
#define _TXBUF1                 0x02
#define _TXBUF2                 0x04
#define _TXBUF3                 0x08
#define _TXBUF4                 0x10
#define _TXBUF5                 0x20
#define _TXBUF6                 0x40
#define _TXBUF7                 0x80

//==============================================================================


//==============================================================================
//        DMABCH Bits

extern __at(0x0F6B) __sfr DMABCH;

typedef struct
  {
  unsigned BC8                  : 1;
  unsigned BC9                  : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __DMABCHbits_t;

extern __at(0x0F6B) volatile __DMABCHbits_t DMABCHbits;

#define _BC8                    0x01
#define _BC9                    0x02

//==============================================================================


//==============================================================================
//        DMABCL Bits

extern __at(0x0F6C) __sfr DMABCL;

typedef struct
  {
  unsigned BC0                  : 1;
  unsigned BC1                  : 1;
  unsigned BC2                  : 1;
  unsigned BC3                  : 1;
  unsigned BC4                  : 1;
  unsigned BC5                  : 1;
  unsigned BC6                  : 1;
  unsigned BC7                  : 1;
  } __DMABCLbits_t;

extern __at(0x0F6C) volatile __DMABCLbits_t DMABCLbits;

#define _BC0                    0x01
#define _BC1                    0x02
#define _BC2                    0x04
#define _BC3                    0x08
#define _BC4                    0x10
#define _BC5                    0x20
#define _BC6                    0x40
#define _BC7                    0x80

//==============================================================================


//==============================================================================
//        RXADDRH Bits

extern __at(0x0F6D) __sfr RXADDRH;

typedef struct
  {
  unsigned RXADDR8              : 1;
  unsigned RXADDR9              : 1;
  unsigned RXADDR10             : 1;
  unsigned RXADDR11             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __RXADDRHbits_t;

extern __at(0x0F6D) volatile __RXADDRHbits_t RXADDRHbits;

#define _RXADDR8                0x01
#define _RXADDR9                0x02
#define _RXADDR10               0x04
#define _RXADDR11               0x08

//==============================================================================


//==============================================================================
//        RXADDRL Bits

extern __at(0x0F6E) __sfr RXADDRL;

typedef struct
  {
  unsigned RXADDR0              : 1;
  unsigned RXADDR1              : 1;
  unsigned RXADDR2              : 1;
  unsigned RXADDR3              : 1;
  unsigned RXADDR4              : 1;
  unsigned RXADDR5              : 1;
  unsigned RXADDR6              : 1;
  unsigned RXADDR7              : 1;
  } __RXADDRLbits_t;

extern __at(0x0F6E) volatile __RXADDRLbits_t RXADDRLbits;

#define _RXADDR0                0x01
#define _RXADDR1                0x02
#define _RXADDR2                0x04
#define _RXADDR3                0x08
#define _RXADDR4                0x10
#define _RXADDR5                0x20
#define _RXADDR6                0x40
#define _RXADDR7                0x80

//==============================================================================


//==============================================================================
//        TXADDRH Bits

extern __at(0x0F6F) __sfr TXADDRH;

typedef struct
  {
  unsigned TXADDR8              : 1;
  unsigned TXADDR9              : 1;
  unsigned TXADDR10             : 1;
  unsigned TXADDR11             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __TXADDRHbits_t;

extern __at(0x0F6F) volatile __TXADDRHbits_t TXADDRHbits;

#define _TXADDR8                0x01
#define _TXADDR9                0x02
#define _TXADDR10               0x04
#define _TXADDR11               0x08

//==============================================================================


//==============================================================================
//        TXADDRL Bits

extern __at(0x0F70) __sfr TXADDRL;

typedef struct
  {
  unsigned TXADDR0              : 1;
  unsigned TXADDR1              : 1;
  unsigned TXADDR2              : 1;
  unsigned TXADDR3              : 1;
  unsigned TXADDR4              : 1;
  unsigned TXADDR5              : 1;
  unsigned TXADDR6              : 1;
  unsigned TXADDR7              : 1;
  } __TXADDRLbits_t;

